plateau = [[400]*10 for i in range(8)]


def display(plateau):
    for line in plateau:
        for flag in line:
            print(flag,'  ',end = '')
        print('\n')


#红或灰；角色；朝向
def information(flag):
    col = flag//100
    self = (flag-col*100)//10
    position = flag - col * 100 - self * 10
    return col, self, position


# 1 红 2 灰     1 法老 2 斯芬克斯（狮身人面像） 3 圣甲虫 4 金字塔 5亡灵之神      1 北 2 西 3 南 4东
def mode_classic(pla):
    for i in range(8):
        pla[i][9] = 200
        pla[i][0] = 100
    pla[7][1] = pla[0][1] = 200
    pla[0][6] = pla[0][4] = 153#红亡灵之神尖鼻南
    pla[0][5] = 113#红法老南
    pla[3][7] = pla[5][6] = pla[4][0] = pla[0][7] = 144#对的是右方向4和4顺时针的一个方向3    红金字塔东(东南)
    pla[7][8] = pla[0][8] = 100
    pla[0][0] = 123#红斯芬克斯南
    pla[4][7] = pla[3][0] = 141#冲1方向还有1方向的顺时针4方向   红金字塔北（东北）
    pla[4][2] = pla[7][2] = pla[2][3] =  pla[3][9] = 242#面向2还有2的顺时针1   灰金字塔西（西北）
    pla[3][2] = pla[4][9] = 243#3还有3的顺时针2   灰金字塔南（西南）
    pla[7][9] = 221#灰斯芬克斯北
    pla[7][5] = pla[7][3] = 251#灰亡灵之神尖鼻北
    pla[7][4] = 211#灰法老北
    pla[1][2] = 143#3和3的顺时针2   红金字塔南
    pla[3][4] = 132#红圣甲虫西（西北）
    pla[3][5] = 131#红圣甲虫北（东北）
    pla[4][4] = 233#灰圣甲虫南（西南）
    pla[4][5] = 234#灰圣甲虫东（东南）
    pla[6][7] = 241#1和1的顺时针4   灰金字塔北（东北）


def mode_imhptep(pla):
    for i in range(8):
        pla[i][0] = 100
        pla[i][9] = 200
    pla[0][0] = 123
    pla[4][8] = pla[2][6] = pla[3][0] = 141#面向1和1的顺时针4
    pla[5][6] = pla[3][8] = pla[4][0] = 144#4和4的顺时针3
    pla[2][3] = pla[4][1] = pla[3][9] = 242#2和2的顺时针1
    pla[5][3] = pla[3][1] = pla[4][9] = 243#3和3的顺时针2
    pla[7][9] = 221
    pla[0][1] = pla[7][1] = 200
    pla[0][8] = pla[7][8] = 100
    pla[7][2] = pla[4][4] = 233
    pla[0][7] = pla[3][5] = 131
    pla[3][4] = 244
    pla[4][5] = 142
    pla[0][4] = pla[0][6] = 153
    pla[7][3] = pla[7][5] = 251
    pla[0][5] = 113
    pla[7][4] = 211


def mode_dynasty(pla):
    for i in range(8):
        pla[i][0] = 100
        pla[i][9] = 200
    pla[0][0] = 123
    pla[2][0] = 141
    pla[3][0] = pla[0][6] = pla[4][5] = 144#4和4的顺时针3
    pla[7][9] = 221
    pla[5][9] = 243#3和3的顺时针2
    pla[4][9] = pla[3][4] = pla[7][3] = 242#2和2的顺时针1
    pla[0][1] = pla[7][1] = 200
    pla[0][8] = pla[7][8] = 100
    pla[0][4] = pla[2][4] = 143#3和3的顺时针2
    pla[0][5] = pla[2][5] = 153
    pla[5][4] = pla[7][4] = 251
    pla[5][5] = pla[7][5] = 241#1和1的顺时针4
    pla[1][5] = 113
    pla[3][2] = 134
    pla[2][6] = 133#3和3的顺时针2
    pla[3][6] = 244#4和4的顺时针3
    pla[4][3] = 142#2和2的顺时针1
    pla[4][7] = 232
    pla[5][3] = 231
    pla[6][4] = 211




